Tekla Open API Reference for Tekla Structures 2025
BasePoint Constructor
Overload List
Name | Description
BasePoint(String)
 Initializes a new instance of the BasePoint class.
BasePoint(Int32, Guid, String, String, String, String, Double, Double, Double, Double, Double, Double, Double, Double, Double, Boolean, Boolean)
 Initializes a new instance of the BasePoint class.
Top
See Also
Reference
BasePoint Class
Tekla.Structures.Model Namespace